In [148]:
## import libraries
import pandas as pd 
import numpy as np
import matplotlib.pylab as plt
import warnings

In [153]:
!pip install scipy

Requirement already satisfied: scipy in c:\users\elyon\anaconda3\lib\site-packages (1.11.4)
Requirement already satisfied: numpy<1.28.0,>=1.21.6 in c:\users\elyon\anaconda3\lib\site-packages (from scipy) (1.26.4)

In [154]:
from scipy import stats

In [74]:
## import file 1
customer =pd.read_csv(r"C:\Users\elyon\OneDrive\Documents\chinook files\Customer.csv")

In [105]:
## import file 2
invoice = pd.read_csv(r"C:\Users\elyon\OneDrive\Documents\chinook files\Invoice.csv")

In [20]:
customer.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,NaN,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,+49 0711 2842222,NaN,leonekohler@surfeu.de,5
2,3,François,Tremblay,NaN,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,NaN,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,NaN,Ullevålsveien 14,Oslo,NaN,Norway,0171,+47 22 44 22 22,NaN,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,NaN,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [106]:
invoice.head(5)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,NaN,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,NaN,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [9]:
## Clean customer data

In [10]:
customer.duplicated().sum()

0

In [16]:
## check for null values 
customer.isnull().sum()

CustomerId       0
FirstName        0
LastName         0
Company         49
Address          0
City             0
State           29
Country          0
PostalCode       4
Phone            1
Fax             47
Email            0
SupportRepId     0
dtype: int64

In [75]:
## remove unnecesary column
cols = ['Company','Address','City','State','PostalCode','Phone','Fax','Email','SupportRepId']
customer = customer.drop(cols, axis = 1).copy()

In [76]:
customer.head()

   CustomerId  FirstName     LastName         Country
0           1       Luís    Gonçalves          Brazil
1           2     Leonie       Köhler         Germany
2           3   François     Tremblay          Canada
3           4      Bjørn       Hansen          Norway
4           5  František  Wichterlová  Czech Republic

In [90]:
## Rename columns 
customer =customer.rename(columns={'CustomerId':'Customer_Id',
                         'FirstName':'First_Name',
                         'LastName':'Last_Name'})

In [38]:
customer.isnull().sum()

CustomerId    0
FirstName     0
LastName      0
Country       0
dtype: int64

In [91]:
customer.dtypes

Customer_Id     int64
First_Name     object
Last_Name      object
Country        object
dtype: object

In [39]:
### clean invoice data

In [107]:
invoice.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,NaN,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,NaN,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [44]:
## check duplicates
invoice.duplicated().sum()

0

In [108]:
invoice.describe()

        InvoiceId  CustomerId       Total
count  412.000000  412.000000  412.000000
mean   206.500000   29.929612    5.651942
std    119.078406   17.010585    4.745320
min      1.000000    1.000000    0.990000
25%    103.750000   15.000000    1.980000
50%    206.500000   30.000000    3.960000
75%    309.250000   45.000000    8.910000
max    412.000000   59.000000   25.860000

In [109]:
invoice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   InvoiceId          412 non-null    int64
 1   CustomerId         412 non-null    int64
 2   InvoiceDate        412 non-null    object
 3   BillingAddress     412 non-null    object
 4   BillingCity        412 non-null    object
 5   BillingState       210 non-null    object
 6   BillingCountry     412 non-null    object
 7   BillingPostalCode  384 non-null    object
 8   Total              412 non-null    float64
dtypes: float64(1), int64(2), object(6)
memory usage: 29.1+ KB

In [110]:
## change invoicedate datatype to date 
invoice['InvoiceDate'] = pd.to_datetime(invoice['InvoiceDate'])

In [111]:
invoice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   InvoiceId          412 non-null    int64
 1   CustomerId         412 non-null    int64
 2   InvoiceDate        412 non-null    datetime64[ns]
 3   BillingAddress     412 non-null    object
 4   BillingCity        412 non-null    object
 5   BillingState       210 non-null    object
 6   BillingCountry     412 non-null    object
 7   BillingPostalCode  384 non-null    object
 8   Total              412 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(5)
memory usage: 29.1+ KB

In [119]:
## rename column'total'
invoice=invoice.rename(columns ={'Total':'Sales'})

In [120]:
## rename other columns 
invoice=invoice.rename(columns = {'InvoiceId':'Invoice_Id',
                          'CustomerId':'Customer_Id',
                          'InvoiceDate':'Invoice_Date'})

In [164]:
## drop irrelevant columns
col = ['BillingAddress','BillingCity','BillingState','BillingCountry','BillingPostalCode']
invoice = invoice.drop(col, axis = 1).copy()

In [165]:
df = pd.DataFrame(invoice)

In [166]:
df['Z-score'] = stats.zscore(df['Sales'])

In [167]:
## identify outliers using the z-score 
outliers = df[df['Z-score'].abs()>3]

print('Outliers:')
print(outliers)

Outliers:
     Invoice_Id  Customer_Id Invoice_Date  Sales   Z-score
95           96           45   2010-02-18  21.86  3.419741
193         194           46   2011-04-28  21.86  3.419741
298         299           26   2012-08-05  23.86  3.841721
403         404            6   2013-11-13  25.86  4.263702

In [169]:
invoice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Invoice_Id    412 non-null    int64
 1   Customer_Id   412 non-null    int64
 2   Invoice_Date  412 non-null    datetime64[ns]
 3   Sales         412 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 13.0 KB

In [172]:
customer.head()

   Customer_Id First_Name    Last_Name         Country
0            1       Luís    Gonçalves          Brazil
1            2     Leonie       Köhler         Germany
2            3   François     Tremblay          Canada
3            4      Bjørn       Hansen          Norway
4            5  František  Wichterlová  Czech Republic

In [173]:
invoice.head()

   Invoice_Id  Customer_Id Invoice_Date  Sales
0           1            2   2009-01-01   1.98
1           2            4   2009-01-02   3.96
2           3            8   2009-01-03   5.94
3           4           14   2009-01-06   8.91
4           5           23   2009-01-11  13.86

In [174]:
## export data
customer.to_csv('cleaned_customer.data.csv',index=False)

In [175]:
## export data
invoice.to_csv('cleaned_invoice.data.csv',index=False)